# ItemNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ItemNumber Property
FabricationPart Class See Also
---
The item number that is used for identification, re-ordering from shop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ItemNumber { get; set; }
```

Visual Basic
---
```text
Public Property ItemNumber As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ItemNumber {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace